_org_posts/_posts/2022-01-30-abc237-c-upsolving.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: abc237 C - kasaka
#+HTML: tags: AtCoder STL
#+HTML: ---
#+OPTIONS: ^:nil

** C - Kasaka

** 접근하기
#+BEGIN_EXAMPLE
앞의 a의 수를 센다. -> x
뒤의 a수를 센다     -> y

y > x 이면 string(y-x, 'a')를 앞에 붙임

str == reverse(string) -> 팰린드롬 -> Yes출력
#+END_EXAMPLE

** 코드
#+BEGIN_SRC cpp
#include <bits/stdc++.h>
using namespace std;
#define FASTIO ios_base::sync_with_stdio(false); cin.tie(nullptr);
typedef long long ll;

int N;

string str;

int main(int argc, char* argv[])
{
    cin >> str;
    int size = str.size();
    
    // left ->
    int x = 0;
    for(int i=0;i<size;i++) {
        if (str[i] == 'a') x++;    
        else break;
    }

    // <- right
    int y = 0;
    for(int i=size-1;i>=0;i--) {
        if (str[i] == 'a') y++;    
        else break;
    }
  
    if (x < y) {
        string as(y-x, 'a');
        str = as + str;
    }

    string rev = str;
    reverse(rev.begin(), rev.end());

    if (str == rev) {
        cout << "Yes" << '\n';
    } else {
        cout << "No" << '\n';
    }

    return 0;
}
#+END_SRC


** 문제 링크
- https://atcoder.jp/contests/abc237/tasks/abc237_c
