_posts/2022-01-30-abc237-c-upsolving.html
---
title: abc237 C - kasaka
tags: AtCoder STL
toc: true
toc_sticky: true
---

<div id="outline-container-org4ae7871" class="outline-2">
<h2 id="org4ae7871">C - Kasaka</h2>
</div>

<div id="outline-container-orgf8a92ff" class="outline-2">
<h2 id="orgf8a92ff">접근하기</h2>
<div class="outline-text-2" id="text-orgf8a92ff">
<pre class="example">
앞의 a의 수를 센다. -&gt; x
뒤의 a수를 센다     -&gt; y

y &gt; x 이면 string(y-x, 'a')를 앞에 붙임

str == reverse(string) -&gt; 팰린드롬 -&gt; Yes출력
</pre>
</div>
</div>

<div id="outline-container-org9f08a2e" class="outline-2">
<h2 id="org9f08a2e">코드</h2>
<div class="outline-text-2" id="text-org9f08a2e">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">nullptr</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">str</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    cin &gt;&gt; str;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">size</span> = str.size();

    <span style="color: #888a85;">// </span><span style="color: #888a85;">left -&gt;</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;size;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (str[i] == <span style="color: #ad7fa8; font-style: italic;">'a'</span>) x++;    
        <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">break</span>;
    }

    <span style="color: #888a85;">// </span><span style="color: #888a85;">&lt;- right</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=size-1;i&gt;=0;i--) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (str[i] == <span style="color: #ad7fa8; font-style: italic;">'a'</span>) y++;    
        <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">break</span>;
    }

    <span style="color: #729fcf; font-weight: bold;">if</span> (x &lt; y) {
        <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">as</span>(y-x, <span style="color: #ad7fa8; font-style: italic;">'a'</span>);
        str = as + str;
    }

    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">rev</span> = str;
    reverse(rev.begin(), rev.end());

    <span style="color: #729fcf; font-weight: bold;">if</span> (str == rev) {
        cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"Yes"</span> &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">"No"</span> &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orge86500f" class="outline-2">
<h2 id="orge86500f">문제 링크</h2>
<div class="outline-text-2" id="text-orge86500f">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc237/tasks/abc237_c">https://atcoder.jp/contests/abc237/tasks/abc237_c</a></li>
</ul>
</div>
</div>
